fix: @Nuttymoon comments
